Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/edc/PIC32MZ2064DAL169.PIC
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="EPC" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="EPC" edc:nmmrflags="0t" edc:nmmrid="184" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EPC" edc:desc="" edc:mask="0xffffffff" edc:name="EPC" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NestedEPC" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NestedEPC" edc:nmmrflags="0b" edc:nmmrid="440" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EPC" edc:desc="" edc:mask="0xffffffff" edc:name="EPC" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PRId" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000010000000000000000" edc:name="PRId" edc:nmmrflags="0t" edc:nmmrid="188" edc:nzwidth="0x20" edc:por="00000000000000010000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="Patch" edc:desc="" edc:mask="0x3" edc:name="Patch" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="MINrev" edc:desc="" edc:mask="0x7" edc:name="MINrev" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="MAJrev" edc:desc="" edc:mask="0x7" edc:name="MAJrev" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="PrID" edc:desc="" edc:mask="0xff" edc:name="PrID" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="CoID" edc:desc="" edc:mask="0xff" edc:name="CoID" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="rrnnnnnnnnnnnnnnnnnn--rrrrrrrrrr" edc:cname="EBASE" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000000000000000" edc:name="EBASE" edc:nmmrflags="0a" edc:nmmrid="316" edc:nzwidth="0x20" edc:por="10000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CPUNum" edc:desc="" edc:mask="0x3ff" edc:name="CPUNum" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="ExBase" edc:desc="" edc:mask="0x3ffff" edc:name="ExBase" edc:nzwidth="0x12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnrrrrrrrrrr" edc:cname="CDMMBase" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CDMMBase" edc:nmmrflags="0b" edc:nmmrid="444" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CDMMSize" edc:desc="" edc:mask="0x1ff" edc:name="CDMMSize" edc:nzwidth="0x9"/>
            <edc:SFRFieldDef edc:cname="CI" edc:desc="" edc:mask="0x1" edc:name="CI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CDMMUA" edc:desc="" edc:mask="0x3fffff" edc:name="CDMMUA" edc:nzwidth="0x15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="rnnnnnnrrrrr-rrrrrrrrrrrr----nnn" edc:cname="Config" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000010000000000" edc:name="Config" edc:nmmrflags="0t" edc:nmmrid="192" edc:nzwidth="0x20" edc:por="10000000000000000000010000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="K0" edc:desc="" edc:mask="0x7" edc:name="K0" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="MT" edc:desc="" edc:mask="0x7" edc:name="MT" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="AR" edc:desc="" edc:mask="0x7" edc:name="AR" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="AT" edc:desc="" edc:mask="0x3" edc:name="AT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="BE" edc:desc="" edc:mask="0x1" edc:name="BE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BM" edc:desc="" edc:mask="0x1" edc:name="DS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MM" edc:desc="" edc:mask="0x3" edc:name="MM" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MDU" edc:desc="" edc:mask="0x1" edc:name="MDU" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SB" edc:desc="" edc:mask="0x1" edc:name="SB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UDI" edc:desc="" edc:mask="0x1" edc:name="UDI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSP" edc:desc="" edc:mask="0x1" edc:name="DSP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ISP" edc:desc="" edc:mask="0x1" edc:name="ISP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KU" edc:desc="" edc:mask="0x7" edc:name="KU" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="K23" edc:desc="" edc:mask="0x7" edc:name="K23" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrr--rrrrr" edc:cname="Config1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000000000000000" edc:name="Config1" edc:nmmrflags="0a" edc:nmmrid="320" edc:nzwidth="0x20" edc:por="10000000000000000000000000000110">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FP" edc:desc="" edc:mask="0x1" edc:name="FP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP" edc:desc="" edc:mask="0x1" edc:name="EP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CA" edc:desc="" edc:mask="0x1" edc:name="CA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WR" edc:desc="" edc:mask="0x1" edc:name="WR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PC" edc:desc="" edc:mask="0x1" edc:name="PC" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="DA" edc:desc="" edc:mask="0x7" edc:name="DA" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="DL" edc:desc="" edc:mask="0x7" edc:name="DL" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="DS" edc:desc="" edc:mask="0x7" edc:name="DS" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="IA" edc:desc="" edc:mask="0x7" edc:name="IA" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="IL" edc:desc="" edc:mask="0x7" edc:name="IL" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="IS" edc:desc="" edc:mask="0x7" edc:name="IS" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="MMUsz" edc:desc="" edc:mask="0x3f" edc:name="MMUsz" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="r-------------------------------" edc:cname="Config2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000000000000000000000000000" edc:name="Config2" edc:nmmrflags="0b" edc:nmmrid="448" edc:nzwidth="0x20" edc:por="10000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="31"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M14Kec-NMMR.Module" edc:_refcount="1" edc:access="r--------rrrrrrnrrrrrr-r-rrrr--r" edc:cname="Config3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000001000101011110101100000" edc:name="Config3" edc:nmmrflags="0c" edc:nmmrid="576" edc:nzwidth="0x20" edc:por="10000000001000101011110101100000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TL" edc:desc="" edc:mask="0x1" edc:name="TL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="CDDM" edc:desc="" edc:mask="0x1" edc:name="CDDM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SP" edc:desc="" edc:mask="0x1" edc:name="SP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VInt" edc:desc="" edc:mask="0x1" edc:name="VInt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VEIC" edc:desc="" edc:mask="0x1" edc:name="VEIC" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ITL" edc:desc="" edc:mask="0x1" edc:name="ITL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="DSPP" edc:desc="" edc:mask="0x1" edc:name="DSPP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSP2P" edc:desc="" edc:mask="0x1" edc:name="DSP2P" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXI" edc:desc="" edc:mask="0x1" edc:name="RXI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ULRI" edc:desc="" edc:mask="0x1" edc:name="ULRI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ISA" edc:desc="" edc:mask="0x3" edc:name="ISA" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ISAONEXC" edc:desc="" edc:mask="0x1" edc:name="ISAONEXC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCU" edc:desc="" edc:mask="0x1" edc:name="MCU" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MMAR" edc:desc="" edc:mask="0x7" edc:name="MMAR" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="IPLW" edc:desc="" edc:mask="0x3" edc:name="IPLW" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="M" edc:desc="" edc:mask="0x1" edc:name="M" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
