Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/edc/PIC32MZ2064DAL169.PIC
      <edc:SFRDef edc:_addr="0x1F860270" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------n---n-----------" edc:cname="CNCONC" edc:desc="" edc:grp="PORTC" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-----------" edc:name="CNCONC" edc:nzwidth="0x20" edc:por="----------------0---0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE C" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860280" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnn-------nnnn-" edc:cname="CNENC" edc:desc="" edc:grp="PORTC" edc:impl="0xffc0f01e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000-------0000-" edc:name="CNENC" edc:nzwidth="0x20" edc:por="----------------0000-------0000-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEC1" edc:desc="" edc:mask="0x1" edc:name="CNIEC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC2" edc:desc="" edc:mask="0x1" edc:name="CNIEC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC3" edc:desc="" edc:mask="0x1" edc:name="CNIEC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC4" edc:desc="" edc:mask="0x1" edc:name="CNIEC4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEC12" edc:desc="" edc:mask="0x1" edc:name="CNIEC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC13" edc:desc="" edc:mask="0x1" edc:name="CNIEC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC14" edc:desc="" edc:mask="0x1" edc:name="CNIEC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC15" edc:desc="" edc:mask="0x1" edc:name="CNIEC15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860290" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnn-------nnnn-" edc:cname="CNSTATC" edc:desc="" edc:grp="PORTC" edc:impl="0xfffff01e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000-------0000-" edc:name="CNSTATC" edc:nzwidth="0x20" edc:por="----------------0000-------0000-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC1" edc:desc="" edc:mask="0x1" edc:name="CNSTATC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC2" edc:desc="" edc:mask="0x1" edc:name="CNSTATC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC3" edc:desc="" edc:mask="0x1" edc:name="CNSTATC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC4" edc:desc="" edc:mask="0x1" edc:name="CNSTATC4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC12" edc:desc="" edc:mask="0x1" edc:name="CNSTATC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC13" edc:desc="" edc:mask="0x1" edc:name="CNSTATC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC14" edc:desc="" edc:mask="0x1" edc:name="CNSTATC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC15" edc:desc="" edc:mask="0x1" edc:name="CNSTATC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8602A0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnn-------nnnn-" edc:cname="CNNEC" edc:desc="" edc:impl="0xf01e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000-------0000-" edc:name="CNNEC" edc:nzwidth="32" edc:por="----------------0000-------0000-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEC1" edc:mask="0x1" edc:name="CNNEC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC2" edc:mask="0x1" edc:name="CNNEC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC3" edc:mask="0x1" edc:name="CNNEC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC4" edc:mask="0x1" edc:name="CNNEC4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEC12" edc:mask="0x1" edc:name="CNNEC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC13" edc:mask="0x1" edc:name="CNNEC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC14" edc:mask="0x1" edc:name="CNNEC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC15" edc:mask="0x1" edc:name="CNNEC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
