Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/edc/PIC32MZ2064DAL169.PIC
      <edc:SFRDef edc:_addr="0x1F860350" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnn-nnnnnnnn" edc:cname="CNPUD" edc:desc="" edc:grp="PORTD" edc:impl="0xfffffeff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000-00000000" edc:name="CNPUD" edc:nzwidth="0x20" edc:por="----------------0000000-00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUD0" edc:desc="" edc:mask="0x1" edc:name="CNPUD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD1" edc:desc="" edc:mask="0x1" edc:name="CNPUD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD2" edc:desc="" edc:mask="0x1" edc:name="CNPUD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD3" edc:desc="" edc:mask="0x1" edc:name="CNPUD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD4" edc:desc="" edc:mask="0x1" edc:name="CNPUD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD5" edc:desc="" edc:mask="0x1" edc:name="CNPUD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD6" edc:desc="" edc:mask="0x1" edc:name="CNPUD6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD7" edc:desc="" edc:mask="0x1" edc:name="CNPUD7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUD9" edc:desc="" edc:mask="0x1" edc:name="CNPUD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD10" edc:desc="" edc:mask="0x1" edc:name="CNPUD10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD11" edc:desc="" edc:mask="0x1" edc:name="CNPUD11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD12" edc:desc="" edc:mask="0x1" edc:name="CNPUD12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD13" edc:desc="" edc:mask="0x1" edc:name="CNPUD13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD14" edc:desc="" edc:mask="0x1" edc:name="CNPUD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUD15" edc:desc="" edc:mask="0x1" edc:name="CNPUD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860360" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnn-nnnnnnnn" edc:cname="CNPDD" edc:desc="" edc:grp="PORTD" edc:impl="0xfffffeff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000-00000000" edc:name="CNPDD" edc:nzwidth="0x20" edc:por="----------------0000000-00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDD0" edc:desc="" edc:mask="0x1" edc:name="CNPDD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD1" edc:desc="" edc:mask="0x1" edc:name="CNPDD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD2" edc:desc="" edc:mask="0x1" edc:name="CNPDD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD3" edc:desc="" edc:mask="0x1" edc:name="CNPDD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD4" edc:desc="" edc:mask="0x1" edc:name="CNPDD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD5" edc:desc="" edc:mask="0x1" edc:name="CNPDD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD6" edc:desc="" edc:mask="0x1" edc:name="CNPDD6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD7" edc:desc="" edc:mask="0x1" edc:name="CNPDD7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDD9" edc:desc="" edc:mask="0x1" edc:name="CNPDD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD10" edc:desc="" edc:mask="0x1" edc:name="CNPDD10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD11" edc:desc="" edc:mask="0x1" edc:name="CNPDD11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD12" edc:desc="" edc:mask="0x1" edc:name="CNPDD12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD13" edc:desc="" edc:mask="0x1" edc:name="CNPDD13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD14" edc:desc="" edc:mask="0x1" edc:name="CNPDD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDD15" edc:desc="" edc:mask="0x1" edc:name="CNPDD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860370" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------n---n-----------" edc:cname="CNCOND" edc:desc="" edc:grp="PORTD" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-----------" edc:name="CNCOND" edc:nzwidth="0x20" edc:por="----------------0---0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE D" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860380" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnn-nnnnnnnn" edc:cname="CNEND" edc:desc="" edc:grp="PORTD" edc:impl="0xffc0feff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000-00000000" edc:name="CNEND" edc:nzwidth="0x20" edc:por="----------------0000000-00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIED0" edc:desc="" edc:mask="0x1" edc:name="CNIED0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED1" edc:desc="" edc:mask="0x1" edc:name="CNIED1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED2" edc:desc="" edc:mask="0x1" edc:name="CNIED2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED3" edc:desc="" edc:mask="0x1" edc:name="CNIED3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED4" edc:desc="" edc:mask="0x1" edc:name="CNIED4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED5" edc:desc="" edc:mask="0x1" edc:name="CNIED5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED6" edc:desc="" edc:mask="0x1" edc:name="CNIED6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED7" edc:desc="" edc:mask="0x1" edc:name="CNIED7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIED9" edc:desc="" edc:mask="0x1" edc:name="CNIED9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED10" edc:desc="" edc:mask="0x1" edc:name="CNIED10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED11" edc:desc="" edc:mask="0x1" edc:name="CNIED11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED12" edc:desc="" edc:mask="0x1" edc:name="CNIED12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED13" edc:desc="" edc:mask="0x1" edc:name="CNIED13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED14" edc:desc="" edc:mask="0x1" edc:name="CNIED14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIED15" edc:desc="" edc:mask="0x1" edc:name="CNIED15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860390" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnn-nnnnnnnn" edc:cname="CNSTATD" edc:desc="" edc:grp="PORTD" edc:impl="0xfffffeff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000-00000000" edc:name="CNSTATD" edc:nzwidth="0x20" edc:por="----------------0000000-00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATD0" edc:desc="" edc:mask="0x1" edc:name="CNSTATD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD1" edc:desc="" edc:mask="0x1" edc:name="CNSTATD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD2" edc:desc="" edc:mask="0x1" edc:name="CNSTATD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD3" edc:desc="" edc:mask="0x1" edc:name="CNSTATD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD4" edc:desc="" edc:mask="0x1" edc:name="CNSTATD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD5" edc:desc="" edc:mask="0x1" edc:name="CNSTATD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD6" edc:desc="" edc:mask="0x1" edc:name="CNSTATD6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD7" edc:desc="" edc:mask="0x1" edc:name="CNSTATD7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD9" edc:desc="" edc:mask="0x1" edc:name="CNSTATD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD10" edc:desc="" edc:mask="0x1" edc:name="CNSTATD10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD11" edc:desc="" edc:mask="0x1" edc:name="CNSTATD11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD12" edc:desc="" edc:mask="0x1" edc:name="CNSTATD12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD13" edc:desc="" edc:mask="0x1" edc:name="CNSTATD13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD14" edc:desc="" edc:mask="0x1" edc:name="CNSTATD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATD15" edc:desc="" edc:mask="0x1" edc:name="CNSTATD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8603A0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnn-nnnnnnnn" edc:cname="CNNED" edc:desc="" edc:impl="0xfeff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000-00000000" edc:name="CNNED" edc:nzwidth="32" edc:por="----------------0000000-00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNED0" edc:mask="0x1" edc:name="CNNED0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED1" edc:mask="0x1" edc:name="CNNED1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED2" edc:mask="0x1" edc:name="CNNED2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED3" edc:mask="0x1" edc:name="CNNED3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED4" edc:mask="0x1" edc:name="CNNED4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED5" edc:mask="0x1" edc:name="CNNED5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED6" edc:mask="0x1" edc:name="CNNED6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED7" edc:mask="0x1" edc:name="CNNED7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNED9" edc:mask="0x1" edc:name="CNNED9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED10" edc:mask="0x1" edc:name="CNNED10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED11" edc:mask="0x1" edc:name="CNNED11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED12" edc:mask="0x1" edc:name="CNNED12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED13" edc:mask="0x1" edc:name="CNNED13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED14" edc:mask="0x1" edc:name="CNNED14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNED15" edc:mask="0x1" edc:name="CNNED15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8603B0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnn-nnnnnnnn" edc:cname="CNFD" edc:desc="" edc:impl="0xfeff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000-00000000" edc:name="CNFD" edc:nzwidth="32" edc:por="----------------0000000-00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFD0" edc:mask="0x1" edc:name="CNFD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD1" edc:mask="0x1" edc:name="CNFD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD2" edc:mask="0x1" edc:name="CNFD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD3" edc:mask="0x1" edc:name="CNFD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD4" edc:mask="0x1" edc:name="CNFD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD5" edc:mask="0x1" edc:name="CNFD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD6" edc:mask="0x1" edc:name="CNFD6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD7" edc:mask="0x1" edc:name="CNFD7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFD9" edc:mask="0x1" edc:name="CNFD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD10" edc:mask="0x1" edc:name="CNFD10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD11" edc:mask="0x1" edc:name="CNFD11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD12" edc:mask="0x1" edc:name="CNFD12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD13" edc:mask="0x1" edc:name="CNFD13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD14" edc:mask="0x1" edc:name="CNFD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFD15" edc:mask="0x1" edc:name="CNFD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8603C0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnn-nnnnnnnn" edc:cname="SRCON0D" edc:desc="" edc:impl="0xfeff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000-00000000" edc:name="SRCON0D" edc:nzwidth="32" edc:por="----------------0000000-00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR0D0" edc:mask="0x1" edc:name="SR0D0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SR0D1" edc:mask="0x1" edc:name="SR0D1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0D2" edc:mask="0x1" edc:name="SR0D2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0D3" edc:mask="0x1" edc:name="SR0D3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0D4" edc:mask="0x1" edc:name="SR0D4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0D5" edc:mask="0x1" edc:name="SR0D5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0D6" edc:mask="0x1" edc:name="SR0D6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0D7" edc:mask="0x1" edc:name="SR0D7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0D9" edc:mask="0x1" edc:name="SR0D9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0D10" edc:mask="0x1" edc:name="SR0D10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0D11" edc:mask="0x1" edc:name="SR0D11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0D12" edc:mask="0x1" edc:name="SR0D12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0D13" edc:mask="0x1" edc:name="SR0D13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0D14" edc:mask="0x1" edc:name="SR0D14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0D15" edc:mask="0x1" edc:name="SR0D15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8603D0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnn-nnnnnnnn" edc:cname="SRCON1D" edc:desc="" edc:impl="0xfeff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000-00000000" edc:name="SRCON1D" edc:nzwidth="32" edc:por="----------------0000000-00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR1D0" edc:mask="0x1" edc:name="SR1D0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1D1" edc:mask="0x1" edc:name="SR1D1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1D2" edc:mask="0x1" edc:name="SR1D2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1D3" edc:mask="0x1" edc:name="SR1D3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1D4" edc:mask="0x1" edc:name="SR1D4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1D5" edc:mask="0x1" edc:name="SR1D5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1D6" edc:mask="0x1" edc:name="SR1D6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1D7" edc:mask="0x1" edc:name="SR1D7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1D9" edc:mask="0x1" edc:name="SR1D9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1D10" edc:mask="0x1" edc:name="SR1D10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1D11" edc:mask="0x1" edc:name="SR1D11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1D12" edc:mask="0x1" edc:name="SR1D12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1D13" edc:mask="0x1" edc:name="SR1D13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1D14" edc:mask="0x1" edc:name="SR1D14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1D15" edc:mask="0x1" edc:name="SR1D15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8603E0" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x1F860400" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="5" edc:access="----------------------nnnn-n--n-" edc:cname="ANSELE" edc:desc="" edc:grp="PORTE" edc:impl="0xffff03d2" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------1111-1--1-" edc:name="ANSELE" edc:nzwidth="0x20" edc:por="----------------------1111-1--1-" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSE1" edc:desc="" edc:mask="0x1" edc:name="ANSE1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSE4" edc:desc="" edc:mask="0x1" edc:name="ANSE4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSE6" edc:desc="" edc:mask="0x1" edc:name="ANSE6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSE7" edc:desc="" edc:mask="0x1" edc:name="ANSE7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSE8" edc:desc="" edc:mask="0x1" edc:name="ANSE8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSE9" edc:desc="" edc:mask="0x1" edc:name="ANSE9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
