Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/edc/PIC32MZ2064DAL169.PIC
      <edc:SFRDef edc:_addr="0x1F8E3030" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBFIFO4" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBFIFO4" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3034" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBFIFO5" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBFIFO5" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3038" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBFIFO6" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBFIFO6" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E303C" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBFIFO7" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBFIFO7" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E3040" edc:offset="32"/>
      <edc:SFRDef edc:_addr="0x1F8E3060" edc:_begin="0x60" edc:_end="0x68" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="2" edc:access="---nnnnn---nnnnn------nnrrrrrrnn" edc:cname="USBOTG" edc:desc="" edc:impl="0x1f1f03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000------0010000000" edc:name="USBOTG" edc:nzwidth="32" edc:por="---00000---00000------0010000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SESSION" edc:desc="" edc:mask="0x1" edc:name="SESSION" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="HOSTREQ" edc:desc="" edc:mask="0x1" edc:name="HOSTREQ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="HOSTMODE" edc:desc="" edc:mask="0x1" edc:name="HOSTMODE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="VBUS" edc:desc="" edc:mask="0x3" edc:name="VBUS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="LSDEV" edc:desc="" edc:mask="0x1" edc:name="LSDEV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FSDEV" edc:desc="" edc:mask="0x1" edc:name="FSDEV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BDEV" edc:desc="" edc:mask="0x1" edc:name="BDEV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RXEDMA" edc:desc="" edc:mask="0x1" edc:name="RXEDMA" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TXEDMA" edc:desc="" edc:mask="0x1" edc:name="TXEDMA" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="TXFIFOSZ" edc:desc="" edc:mask="0xf" edc:name="TXFIFOSZ" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="TXDPB" edc:desc="" edc:mask="0x1" edc:name="TXDPB" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RXFIFOSZ" edc:desc="" edc:mask="0xf" edc:name="RXFIFOSZ" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="RXDPB" edc:desc="" edc:mask="0x1" edc:name="RXDPB" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3064" edc:_begin="0x60" edc:_end="0x68" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="2" edc:access="---nnnnnnnnnnnnn---nnnnnnnnnnnnn" edc:cname="USBFIFOA" edc:desc="" edc:impl="0x1fff1fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---0000000000000---0000000000000" edc:name="USBFIFOA" edc:nzwidth="32" edc:por="---0000000000000---0000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXFIFOAD" edc:desc="" edc:mask="0x1fff" edc:name="TXFIFOAD" edc:nzwidth="13"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RXFIFOAD" edc:desc="" edc:mask="0x1fff" edc:name="RXFIFOAD" edc:nzwidth="13"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E3068" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F8E306C" edc:_begin="0x6c" edc:_end="0x70" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="3" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="USBHWVER" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0xxxxxxxxxxxxxxx" edc:name="USBHWVER" edc:nzwidth="32" edc:por="----------------0xxxxxxxxxxxxxxx" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="VERMINOR" edc:desc="" edc:mask="0x3ff" edc:name="VERMINOR" edc:nzwidth="10"/>
            <edc:SFRFieldDef edc:cname="VERMAJOR" edc:desc="" edc:mask="0x1f" edc:name="VERMAJOR" edc:nzwidth="5"/>
            <edc:SFRFieldDef edc:cname="RC" edc:desc="" edc:mask="0x1" edc:name="RC" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E3070" edc:offset="8"/>
      <edc:SFRDef edc:_addr="0x1F8E3078" edc:_begin="0x78" edc:_end="0xc0" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="4" edc:access="nnnnnnnnnnnnnnnnrrrrrrrrrrrrrrrr" edc:cname="USBINFO" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00111100010111001000110001110111" edc:name="USBINFO" edc:nzwidth="32" edc:por="00111100010111001000110001110111" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXENDPTS" edc:desc="" edc:mask="0xf" edc:name="TXENDPTS" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="RXENDPTS" edc:desc="" edc:mask="0xf" edc:name="RXENDPTS" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="RAMBITS" edc:desc="" edc:mask="0xf" edc:name="RAMBITS" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="DMACHANS" edc:desc="" edc:mask="0xf" edc:name="DMACHANS" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="WTID" edc:desc="" edc:mask="0xf" edc:name="WTID" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="WTCON" edc:desc="" edc:mask="0xf" edc:name="WTCON" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="VPLEN" edc:desc="" edc:mask="0xff" edc:name="VPLEN" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
