Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/edc/PIC32MZ2064DAL169.PIC
      <edc:SFRDef edc:_addr="0x1F8EC040" edc:_begin="0x14" edc:_end="0x50" edc:_modsrc="DOS-EIP-00187_emb_sdio_v1.Module" edc:_refcount="6" edc:access="rrr----rr-r-rrrrrrrrrrrrr-rrrrrr" edc:cname="SDHCCAP" edc:desc="" edc:impl="0xe1abffbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------1x-x-x-00--xxxxxx0-000000" edc:name="SDHCCAP" edc:nzwidth="32" edc:por="-------1x-x-x-00--xxxxxx0-000000" ltx:memberofperipheral="SDHC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TOCLKFREQ" edc:desc="" edc:mask="0x3f" edc:name="TOCLKFREQ" edc:nzwidth="6"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TOCLKU" edc:desc="" edc:mask="0x1" edc:name="TOCLKU" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BASECLK" edc:desc="" edc:mask="0xff" edc:name="BASECLK" edc:nzwidth="8"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="MBLEN" edc:desc="" edc:mask="0x3" edc:name="MBLEN" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="BUS8BIT" edc:desc="" edc:mask="0x1" edc:name="EIGHTBIT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADMA2" edc:desc="" edc:mask="0x1" edc:name="ADMA2" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="HISPEED" edc:desc="" edc:mask="0x1" edc:name="HISPEED" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SRESUME" edc:desc="" edc:mask="0x1" edc:name="SRESUME" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="VOLT3V3" edc:desc="" edc:mask="0x1" edc:name="VOLT3V3" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ASYNCINT" edc:desc="" edc:mask="0x1" edc:name="ASYNCINT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SLOTTYPE" edc:desc="" edc:mask="0x3" edc:name="SLOTTYPE" edc:nzwidth="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8EC044" edc:_begin="0x14" edc:_end="0x50" edc:_modsrc="DOS-EIP-00187_emb_sdio_v1.Module" edc:_refcount="6" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x1F8EC048" edc:_begin="0x14" edc:_end="0x50" edc:_modsrc="DOS-EIP-00187_emb_sdio_v1.Module" edc:_refcount="6" edc:access="------------------------rrrrrrrr" edc:cname="SDHCMAXCAP" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------xxxxxxxx" edc:name="SDHCMAXCAP" edc:nzwidth="32" edc:por="------------------------xxxxxxxx" ltx:memberofperipheral="SDHC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MC3V3" edc:desc="" edc:mask="0xff" edc:name="MC3V3" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8EC04C" edc:_begin="0x14" edc:_end="0x50" edc:_modsrc="DOS-EIP-00187_emb_sdio_v1.Module" edc:_refcount="6" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x1F8EC050" edc:_begin="0x14" edc:_end="0x50" edc:_modsrc="DOS-EIP-00187_emb_sdio_v1.Module" edc:_refcount="6" edc:access="------wwwwwwwwww--------w--wwwww" edc:cname="SDHCFE" edc:desc="" edc:impl="0x3ff009f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------xxxxxxxxxx--------x--xxxxx" edc:name="SDHCFE" edc:nzwidth="32" edc:por="------xxxxxxxxxx--------x--xxxxx" ltx:memberofperipheral="SDHC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FEACNEE" edc:desc="" edc:mask="0x1" edc:name="FEACNEXECERR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FEACTOE" edc:desc="" edc:mask="0x1" edc:name="FEACTOERR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FEACCRCE" edc:desc="" edc:mask="0x1" edc:name="FEACCRCERR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FEACEBE" edc:desc="" edc:mask="0x1" edc:name="FEACEBERR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FEACIDXE" edc:desc="" edc:mask="0x1" edc:name="FEACIDXERR" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="FECNIACE" edc:desc="" edc:mask="0x1" edc:name="FECNIACE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="FECTOE" edc:desc="" edc:mask="0x1" edc:name="FECTOE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FECCRCE" edc:desc="" edc:mask="0x1" edc:name="FECCRCE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FECEBE" edc:desc="" edc:mask="0x1" edc:name="FECEBE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FEIDXE" edc:desc="" edc:mask="0x1" edc:name="FEIDXE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FEDTOE" edc:desc="" edc:mask="0x1" edc:name="FEDTOE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FEDCRCE" edc:desc="" edc:mask="0x1" edc:name="FEDCRCE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FEDEBE" edc:desc="" edc:mask="0x1" edc:name="FEDEBE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FECLE" edc:desc="" edc:mask="0x1" edc:name="FECLE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FEACE" edc:desc="" edc:mask="0x1" edc:name="FEACE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FEAE" edc:desc="" edc:mask="0x1" edc:name="FEAE" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EC054" edc:_begin="0x14" edc:_end="0x50" edc:_modsrc="DOS-EIP-00187_emb_sdio_v1.Module" edc:_refcount="6" edc:access="-----------------------------rrr" edc:cname="SDHCAESTAT" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------------000" edc:name="SDHCAESTAT" edc:nzwidth="32" edc:por="-----------------------------000" ltx:memberofperipheral="SDHC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AERRST" edc:desc="" edc:mask="0x3" edc:name="AERRST" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ALMERR" edc:desc="" edc:mask="0x1" edc:name="ALMERR" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
